<?php

namespace Database\Seeders;

use Illuminate\Database\Console\Seeds\WithoutModelEvents;
use Illuminate\Database\Seeder;
use Illuminate\Support\Facades\DB;

class achievement_seeder extends Seeder
{
    /**
     * Run the database seeds.
     */
    public function run(): void
    {
        DB::table('achievement')->insert(
            [
                [
                    'title' => 'জাতীয় বিশ্ববিদ্যালয়ে চার কোর্সে অন-ক্যাম্পাস অনার্সের ভর্তি কার্যক্রম শেষ ৫ সেপ্টেম্বর',
                    'description' => 'জাতীয় বিশ্ববিদ্যালয়ের মূল ক্যাম্পাসে ২০২২-২৩ শিক্ষাবর্ষে স্নাতক (সম্মান) প্রোগ্রামে প্রথমবারের মতো অন-ক্যাম্পাস অনার্স কোর্স চালু হচ্ছে। অন-ক্যাম্পাস অনার্স কোর্সে চারটি বিষয়ে শিক্ষার্থী ভর্তি হতে পারবেন। গত ২৭ জুলাই থেকে অনলাইনে প্রাথমিক আবেদন ফরম পূরণ শুরু হয়েছে। ভর্তি কার্যক্রম চলবে আজ মঙ্গলবার (৫ সেপ্টেম্বর) পর্যন্ত। ২৫ সেপ্টেম্বর থেকে ক্লাস শুরু হবে ওই চারটি বিষয়ে।',
                    'image' => 'image1.webp',
                ],
                [
                    'title' => 'সৈয়দপুরের এক কলেজ থেকে বুয়েটে ভর্তির সুযোগ পেলেন ১৪ শিক্ষার্থী',
                    'description' => 'নীলফামারীর সৈয়দপুর সরকারি বিজ্ঞান কলেজ থেকে ৩৫ জন বিভিন্ন মেডিকেল কলেজে ভর্তির সুযোগ পাওয়ার পর এবার বাংলাদেশ প্রকৌশল বিশ্ববিদ্যালয়ে (বুয়েটে) ভর্তির সুযোগ পেলেন ১৪ শিক্ষার্থী।

কলেজটির অধ্যক্ষ গোলাম আহমেদ ফারুক জানান, প্রতিষ্ঠানটি থেকে এর আগে ২০২২-২৩ শিক্ষাবর্ষের এমবিবিএস প্রথম বর্ষের ভর্তি পরীক্ষায় অংশ নিয়ে ৩৫ শিক্ষার্থী কৃতিত্বের সঙ্গে উত্তীর্ণ হয়ে সরকারি মেডিকেল কলেজে ভর্তির সুযোগ পেয়েছেন। তাঁদের মধ্যে ছেলে ২০ জন ও মেয়ে ১৫ জন। গত বছর এই সংখ্যা ছিলো ৪৩।
নীলফামারীর সৈয়দপুর শহরের ঐতিহ্যবাহী শিক্ষাপ্রতিষ্ঠানগুলোর মধ্যে একটি সরকারি বিজ্ঞান কলেজ।

গোলাম আহমেদ ফারুক আরও বলেন, এই শিক্ষাপ্রতিষ্ঠানে সুশৃঙ্খল পরিবেশ, পাঠদানে শিক্ষকদের আন্তরিকতা এবং কঠোর তদারকির ফলে প্রতিবছর আশানুরূপ ফলাফল করছেন শিক্ষার্থীরা। মূলত শিক্ষার্থী, শিক্ষক ও অভিভাবকদের সম্মিলিত প্রচেষ্টায় প্রতিবছর মেডিকেল ও প্রকৌশল বিশ্ববিদ্যালয়ের ভর্তি পরীক্ষায় ধারাবাহিক সফলতা ধরে রাখা সম্ভব হচ্ছে। এ বছর প্রতিষ্ঠানটি থেকে ১৪ জন শিক্ষার্থী বুয়েটে ভর্তির সুযোগ পেয়েছেন।

ভর্তির সুযোগ পাওয়া শিক্ষার্থীরা হচ্ছেন মাহির নুরায়ন স্বচ্ছ ২৩১, লামিসা ২৬৫, নোমান ৯১১, রিসা ৪৩১, সৈকত ৫৪১, রাব্বি ৫৫২, আইনুল বারি ৮২০, আতিকুল সিহাব ৮২৭, বৃষ্টি রায় ৮৭১, ইসরাত ১২৮২, ত্বাকি আহমেদ সাদ ১৩০৮, তূর্য্য ১৪৪০, বাঁধন ১৫০৮ ও শাহরিয়ার কবির সিয়াম ৯১৭।

অধ্যক্ষ আরও বলেন, ‘এটি কোভিড ব্যাচ ছিল। সেভাবে আমরা নার্সিং করতে পারিনি। তারপরও এবার ১৪ জন ভর্তির সুযোগ পেয়েছে। গত বছর ১৯ জন ভর্তির সুযোগ পেয়েছিল।’ আগামী দিনে এ সংখ্যা বাড়বে বলে আশা করেন তিনি।',
                    'image' => 'image2.webp',
                ],
                [
                    'title' => 'আন্তঃহাউস সাধারণ জ্ঞান ও গণিত অলিম্পিয়াড - ২০২৩',
                    'description' => 'নীলফামারীর সৈয়দপুর সরকারি বিজ্ঞান কলেজ থেকে ৩৫ জন বিভিন্ন মেডিকেল কলেজে ভর্তির সুযোগ পাওয়ার পর এবার বাংলাদেশ প্রকৌশল বিশ্ববিদ্যালয়ে (বুয়েটে) ভর্তির সুযোগ পেলেন ১৪ শিক্ষার্থী।

কলেজটির অধ্যক্ষ গোলাম আহমেদ ফারুক জানান, প্রতিষ্ঠানটি থেকে এর আগে ২০২২-২৩ শিক্ষাবর্ষের এমবিবিএস প্রথম বর্ষের ভর্তি পরীক্ষায় অংশ নিয়ে ৩৫ শিক্ষার্থী কৃতিত্বের সঙ্গে উত্তীর্ণ হয়ে সরকারি মেডিকেল কলেজে ভর্তির সুযোগ পেয়েছেন। তাঁদের মধ্যে ছেলে ২০ জন ও মেয়ে ১৫ জন। গত বছর এই সংখ্যা ছিলো ৪৩।
নীলফামারীর সৈয়দপুর শহরের ঐতিহ্যবাহী শিক্ষাপ্রতিষ্ঠানগুলোর মধ্যে একটি সরকারি বিজ্ঞান কলেজ।',
                    'image' => 'image3.webp',
                ]
            ]
        );
    }
}
