<?php

namespace Database\Seeders;

use Illuminate\Database\Console\Seeds\WithoutModelEvents;
use Illuminate\Database\Seeder;
use Illuminate\Support\Facades\DB;

class administration_seeder extends Seeder
{
    /**
     * Run the database seeds.
     */
    public function run(): void
    {
        DB::table('administration')->insert([
            'president_name' => 'মোঃ আব্দুল কুদ্দুস',
            'president_designation' => 'সভাপতি',
            'president_message' => 'শিক্ষা একটি মানবিয় প্রক্রিয়া। এই পক্রিয়ায় সফল হতে প্রধানত তিনটি পক্ষকে অবশ্যই জড়িত থাকতে হয়। পক্ষ তিনটি হল শিক্ষার্থী, অভিভাবক ও শিক্ষক। আর এই পক্ষ তিনটিকে সুষ্ঠুভাবে সক্রিয় রাখতে কর্মপরিকল্পনা প্রয়োজন। সেই প্রয়োজনের কথা বিবেচনা করে এই একাডেমিক ক্যালেন্ডার প্রণয়ন করা। এখানে শিক্ষার্থীর লেখাপড়া সুষ্ঠুভাবে হওয়ার বিষয়টি যেমন গুরুত্ব দেওয়া হয়েছে তেমনি শিক্ষার্থীর মনোসামাজিক বিকাশকে গুরুত্ব দেওয়া হয়েছে। তাই এই একাডেমিক ক্যালেন্ডার থেকে একজন শিক্ষার্থী বা অভিভাবক জানতে পারবেন- ১. কলেজের নিয়মাবলী, ২. দৈনিক ক্লাশ রুটিন, ৩. পাঠ পরিকল্পনা, ৪. বিভিন্ন পরীক্ষার সময়সূচি, ৫. ফলাফল প্রকাশের তারিখ, ৬. কাউন্সিলিং কার্যক্রম, ৭. ক্লাশে উপস্থিত/অনুপস্থিতিরি তথ্য, ৮. ছুটির তালিকা, ৯. সহ-পাঠক্রমিক কার্যক্রম, ১০. শিক্ষার্থীদের স্ব স্ব কাউন্সিলরের তথ্য ইত্যাদি। এই সব তথ্য থাকার ফলে একজন অভিভাবক শিক্ষার্থীকে শিক্ষা অর্জন প্রক্রিয়ায় কখন, কিভাবে দায়িত্ব পালন করবেন তা সহজে বুঝতে পারবেন। ফলে অভিভাবক ও শিক্ষকের সমন্বয়ে শিক্ষার্থীর লেখাপড়ার তদারকি জোরালো হয়। এই দ্বিমুখী তদারকি সুষ্ঠু ও নিয়মিতভাবে করা সম্ভব হলে শিক্ষার্থী অবশ্যই লেখাপড়ায় ভাল করবে, প্রত্যাশা অনুযায়ী ভাল ফলাফল করবে। এতে শিক্ষার্থী নিয়ে অভিভাবক শিক্ষক যে স্বপ্ন দেখেন, যে আশা করেন-তা পূরন হবে। ',
            'president_image' => 'image1.jpeg',
            'principal_name' => 'মোঃ সেলিম সরকার',
            'principal_designation' => 'প্রিন্সিপাল',
            'principal_message' => 'শিক্ষা একটি মানবিয় প্রক্রিয়া। এই পক্রিয়ায় সফল হতে প্রধানত তিনটি পক্ষকে অবশ্যই জড়িত থাকতে হয়। পক্ষ তিনটি হল শিক্ষার্থী, অভিভাবক ও শিক্ষক। আর এই পক্ষ তিনটিকে সুষ্ঠুভাবে সক্রিয় রাখতে কর্মপরিকল্পনা প্রয়োজন। সেই প্রয়োজনের কথা বিবেচনা করে এই একাডেমিক ক্যালেন্ডার প্রণয়ন করা। এখানে শিক্ষার্থীর লেখাপড়া সুষ্ঠুভাবে হওয়ার বিষয়টি যেমন গুরুত্ব দেওয়া হয়েছে তেমনি শিক্ষার্থীর মনোসামাজিক বিকাশকে গুরুত্ব দেওয়া হয়েছে। তাই এই একাডেমিক ক্যালেন্ডার থেকে একজন শিক্ষার্থী বা অভিভাবক জানতে পারবেন- ১. কলেজের নিয়মাবলী, ২. দৈনিক ক্লাশ রুটিন, ৩. পাঠ পরিকল্পনা, ৪. বিভিন্ন পরীক্ষার সময়সূচি, ৫. ফলাফল প্রকাশের তারিখ, ৬. কাউন্সিলিং কার্যক্রম, ৭. ক্লাশে উপস্থিত/অনুপস্থিতিরি তথ্য, ৮. ছুটির তালিকা, ৯. সহ-পাঠক্রমিক কার্যক্রম, ১০. শিক্ষার্থীদের স্ব স্ব কাউন্সিলরের তথ্য ইত্যাদি। ',
            'principal_image' => 'image2.jpeg',
            'vice_principal_name' => 'মোঃ নাজমুল হোসেন',
            'vice_principal_designation' => 'ভাইস প্রিন্সিপাল',
            'vice_principal_message' => 'শিক্ষা একটি মানবিয় প্রক্রিয়া। এই পক্রিয়ায় সফল হতে প্রধানত তিনটি পক্ষকে অবশ্যই জড়িত থাকতে হয়। পক্ষ তিনটি হল শিক্ষার্থী, অভিভাবক ও শিক্ষক। আর এই পক্ষ তিনটিকে সুষ্ঠুভাবে সক্রিয় রাখতে কর্মপরিকল্পনা প্রয়োজন। সেই প্রয়োজনের কথা বিবেচনা করে এই একাডেমিক ক্যালেন্ডার প্রণয়ন করা।',
            'vice_principal_image' => 'image3.jpeg',
        ]);
    }
}
